Revit 2027 API
IntegerParameterValue Class
 A class that holds an Integer value of a parameter element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.IntegerParameterValue
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IntegerParameterValue : ParameterValue
Public Class IntegerParameterValue
	Inherits ParameterValue
public ref class IntegerParameterValue : public ParameterValue
type IntegerParameterValue =
    class
        inherit ParameterValue
    end
The IntegerParameterValue type exposes the following members.
Constructors
Name | Description
IntegerParameterValue() |  Default constructor
IntegerParameterValue(Int32) |  Value constructor
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ParameterValue)
Value |  The stored value
Top
Methods
Name | Description
Copy |  Makes an identical copy of the given parameter value.
(Inherited from ParameterValue)
Dispose
(Inherited from ParameterValue)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Tests equality with another instance of the same class.
(Inherited from ParameterValue)
IsSameType |  Tests another instance is of the same value type.
(Inherited from ParameterValue)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace